app/controllers/courses_controller.rb

INSERT INTO "courses" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "fsdaf"], ["content", "fsadfsda"], ["created_at", "2015-09-28 10:29:45.677353"], ["updated_at", "2015-09-28 10:29:45.677353"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_course
      @course = Course.find(params[:id])